[
  {
    "id": "UgzHrhKpr2HbT3uQ7Xl4AaABAg",
    "publishedAt": "1 year ago (edited)",
    "text": "Thanks to Radiacode for sponsoring this video! Use the promo code \"PBS\" to get an exclusive 10% discount at: https://103.radiacode.com/PBS"
  },
  {
    "id": "Ugxjt-KpA2pbHDkGbih4AaABAg",
    "publishedAt": "1 year ago (edited)",
    "text": "Mathematicians: you can't do ∞ - ∞ Physicists: Don't be so negative bro, here's an electron."
  },
  {
    "id": "Ugy-pg11SD-OTUFZK4B4AaABAg",
    "publishedAt": "1 year ago",
    "text": "This is what you get when you leave physicists alone."
  },
  {
    "id": "UgzIFMol9nUU2W1iUlt4AaABAg",
    "publishedAt": "1 year ago",
    "text": "\"Calibrating to reality\" is how you refer to someone that is recovering from social media withdrawal."
  },
  {
    "id": "UgwbBPIGRWtsY_TwdSF4AaABAg",
    "publishedAt": "1 year ago",
    "text": "\"Calibrating to reality\" is my take-away phrase from this episode. Sadly, it was mostly way over my head."
  },
  {
    "id": "Ugzl8CZedSA0rJWfDdF4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I love the \"You think your brain melted with electrons, just wait until we get to Higgs!\"."
  },
  {
    "id": "UgxHP6PR_e6YVkB5hG14AaABAg",
    "publishedAt": "1 year ago",
    "text": "When Feynman and Schwinger were awarded the Nobel prize in 1965 there was a third scientist Tomonaga who independently discovered renormalisation I just thought he deserved a mention."
  },
  {
    "id": "UgzOWxVJKC_1cViDmpR4AaABAg",
    "publishedAt": "1 year ago",
    "text": "A bear sat on our hammock sofa. It did not have negative mass... We still had to renormalize the hammock sofa though"
  },
  {
    "id": "UgweP-i_d2vrOyiyxWx4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Didn't know the mass of an electron is the sum of the mass of a bear and infinity. The more you know"
  },
  {
    "id": "UgxJChaDDReA2bu9Z654AaABAg",
    "publishedAt": "1 year ago",
    "text": "Well, ya just broke my brain. Hope you're happy."
  },
  {
    "id": "Ugy-mRzGLfMYW6uY2154AaABAg",
    "publishedAt": "1 year ago",
    "text": "I kept hearing \"bare ass\". My brain is smooth."
  },
  {
    "id": "UgwrbO8ZEqmvUa42VX14AaABAg",
    "publishedAt": "1 year ago",
    "text": "I almost understood this for a hot second but then I lost it. It does give me hope that I can maybe understand it if I listen enough times."
  },
  {
    "id": "UgxMhsCv-eseTkEeu394AaABAg",
    "publishedAt": "1 year ago",
    "text": "“Negative Bear Mass” is an excellent band name"
  },
  {
    "id": "Ugz_2HfHAFhL4wWtxtF4AaABAg",
    "publishedAt": "1 year ago",
    "text": "The mass of the electron field being infinite if the electron is point like, sounds a bit like the ultraviolet catastrophe where the graph suggested an infinite temperature of the sun before the rest of the graph line was understood."
  },
  {
    "id": "UgxGHEhNIdKmF5ixC654AaABAg",
    "publishedAt": "1 year ago",
    "text": "So glad to still be on this journey with you all."
  },
  {
    "id": "UgwO-HD4Z9cC0i0f1qx4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Questions -Answers = More Questions"
  },
  {
    "id": "UgykqgDqJcNjsl42Fxd4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Yay, real readable subtitles, thank you PBS"
  },
  {
    "id": "UgwozB8RcaDsC1zPkE94AaABAg",
    "publishedAt": "1 year ago",
    "text": "Great video. The last video was amazing. Seeing how you visually presented pair productions that occurred around the \"real\" electron and then randomly annihilate causing the electron to appear to jump around was the best way to think about the Hesenberg Uncertainty Principle in visual form in my opinion. I was really inspired by that! Thank you for advancing science and teach us all! Merry Xmas!"
  },
  {
    "id": "UgyKavPAQmY_pU84-Jt4AaABAg",
    "publishedAt": "1 year ago",
    "text": "\"May you remove your self-energy mass so I can measure your bare mass?\" That should be a fun pickup line for parties."
  },
  {
    "id": "UgzD88QzndR_GvRLnYZ4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Now that’s a title I’m clicking on. Whoever came up with it deserves a raise! 🎉"
  },
  {
    "id": "UgzxNe2gzdL7_Uc64M14AaABAg",
    "publishedAt": "1 year ago (edited)",
    "text": "Entity 1: Our last hack blew up the mass of particles. Entity 2: Let's just set the internal mass to negative to counter that. Entity 1: Yeah, that should work. Entity 2: It's an internal constant, no one will ever know. 14.5 billion years of simulation time later Electric impulses in groups of carbon and hydrogen atoms: \"Hey wait a minute. Why is the bare mass negative? And how is it so unnaturally fine tuned??\""
  },
  {
    "id": "Ugz0PxTMz__bYHdyD7Z4AaABAg",
    "publishedAt": "1 year ago",
    "text": "The title made me go WTF 😂😂"
  },
  {
    "id": "Ugwm8K_nD3ALhqwrE_R4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I always struggle to think of infinity, but it must be there"
  },
  {
    "id": "UgwNs1zwJwU20ez60Ax4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Listening to this feels like surfing a wave of knowledge that would drown you if you tried to take it all in. But the surfing sure is fun."
  },
  {
    "id": "Ugzb_PDtIbK63nJgd9t4AaABAg",
    "publishedAt": "2 months ago (edited)",
    "text": "I can't believe I missed to get any notification for so many videos uploaded in past several months."
  },
  {
    "id": "UgzuV1jW8PqT80tKkcJ4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Removing an infinite subset of an infinite set can result in a set of any size not greater than the original set"
  },
  {
    "id": "UgzSEtHmZ6qs9OcPVn94AaABAg",
    "publishedAt": "1 year ago",
    "text": "At 4:45, the parenthesis makes it confusing, since it would normally be negative 511 eV in the way you present it. You have minus sign before the both terms. Also, shouldn't it be 511 keV? Anyway, still a very solid episode, I'm looking forward to where you take it, since it's such an interesting subject."
  },
  {
    "id": "UgzdaM-VvIodh_H_7Jt4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Would be nice if they put the previous video they talk about in the description"
  },
  {
    "id": "Ugx_N7JtfMyAxwtw2314AaABAg",
    "publishedAt": "1 year ago",
    "text": "this series is brilliant, nice one, more math's please. too many videos skip the details"
  },
  {
    "id": "Ugy57Ar8nIqfZDGBf0R4AaABAg",
    "publishedAt": "1 year ago (edited)",
    "text": "The graph of my thinking I was understanding the video and really understanding it was like the position of the electron"
  },
  {
    "id": "UgzPwC2pyVMencMG24h4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Love ur videos, but can u leave some links of research paper related to the videos for nerds"
  },
  {
    "id": "Ugw7e-GUHQyLHGdjGtp4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Bare Negative Mass had a hit in the 90’s, didn’t they?"
  },
  {
    "id": "Ugx-rmavsUcPIw_Fsw14AaABAg",
    "publishedAt": "1 year ago (edited)",
    "text": "The background sound effects during Matt's narration at about 6 minutes in is really freaking me out!"
  },
  {
    "id": "UgzS6K2jbuW_HCdaAGd4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Will spend holidays pondering my electron."
  },
  {
    "id": "UgwggOKxW-Uzzz9Ainp4AaABAg",
    "publishedAt": "1 year ago",
    "text": "O.K., it sounds like what you're saying is that--in a way--electrons aren't more massive because they only exist part of the time. The est of the time, they're being eniolated by some vertual positron that was created because that's how things work. Interesting. Thank yuo."
  },
  {
    "id": "UgwAu6iDUa7uGPj8M9F4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Merry Christmas PBS Space Time"
  },
  {
    "id": "UgxEwCECWDH7whIISSJ4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Human: \"How, exactly, does the universe work?' Universe: \"None of your business.\""
  },
  {
    "id": "UgxkIM_pS5Ys__4RY_d4AaABAg",
    "publishedAt": "1 year ago",
    "text": "\"Wtf\", I say out loud at the start of every spacetime episode"
  },
  {
    "id": "UgyicywbgD74dLmVEK54AaABAg",
    "publishedAt": "1 year ago",
    "text": "You mentioned that the electron's mass is \"protected by the chiral symmetry of the particle\" (14:30). This is my ignorance, but in what way are electron's chiral? I'm only familiar with chirality in terms of molecular structure. Would love an elaboration on this point."
  },
  {
    "id": "Ugxza_jkSSgqPyHvyFh4AaABAg",
    "publishedAt": "1 month ago",
    "text": "Relationship between electron and matter excited in Univers is mysterious"
  },
  {
    "id": "UgxiBsnhwcjGpTVldHJ4AaABAg",
    "publishedAt": "1 year ago",
    "text": "\"Infinity minus (infinity+1) equals...1\" Oh my brain felt like it sprained itself for a moment there...but, well, it also makes sense! Also, for the lulz of it...\"1 part in 20,000\" isn't by any chance part of the reason why matter exists, is it?"
  },
  {
    "id": "UgyuIXay8X6yxjDGyYB4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I feel like last episode was the start of a semester and last episode was class 1. Im excite!"
  },
  {
    "id": "UgxvJ-Yzu89bfJq6Oo54AaABAg",
    "publishedAt": "1 year ago",
    "text": "Infinity - infinity = electron .... Wtf man. It's Thursday. You can't break my brain like that before Friday."
  },
  {
    "id": "UgybVfEobX1Y06g5ruR4AaABAg",
    "publishedAt": "1 year ago (edited)",
    "text": "in my microscope i see two counter-rotating venturi-like clouds of charge held in place by an antineutrino at the center."
  },
  {
    "id": "Ugxrbin6fxI0UnHadt54AaABAg",
    "publishedAt": "1 year ago (edited)",
    "text": "min: 10:55 the subtitle text says: \"wweeping the infinities under the rug\" 🤣🤣 poor physicists..."
  },
  {
    "id": "Ugy4Ak5Q4ilhEx6lRjh4AaABAg",
    "publishedAt": "1 year ago (edited)",
    "text": "Thank you PBS SpaceTime for your great videos! Happy Holidays!"
  },
  {
    "id": "Ugz7fGkUlj7lITEMVLJ4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Sounds like a \"Blackbody Catastrophe\" awaiting a 21st century Max Planck."
  },
  {
    "id": "Ugx8_orBa-HSoWXWKIN4AaABAg",
    "publishedAt": "1 year ago (edited)",
    "text": "wait... 13:17 with the electron changing positions because of the pair then annihilation, does that mechanism give rise to the fuzziness of its location, or is that just another component of its existence at that scale?"
  },
  {
    "id": "UgxRGjl96xsYwJvCLod4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I like the idea that the vacuum isn't stable at all, and that we simply live within the razor thin improbable edge of quantum immortality where the entire universe just so happens to not be exploding everywhere all at once."
  },
  {
    "id": "UgxHOU4_q4zQTii9fX14AaABAg",
    "publishedAt": "1 year ago",
    "text": "I dig seeing equations make their way back into Space Time episodes. They make me feel smart when I kind of know what I'm looking at lol"
  },
  {
    "id": "UgwVK5GLkBKZLfslP6x4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Stuff like this makes me hopeful for the existence of negative mass so we can someday have ftl, artificial gravity, perpetual motion machines, etc"
  },
  {
    "id": "UgzPR69gPKf9n5tW1jl4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Space Time!"
  },
  {
    "id": "UgxymR8keGMrNOoyNmJ4AaABAg",
    "publishedAt": "1 year ago",
    "text": "8:51 😆 you just described what happens in order for us to view this episode on our screens, especially the led ones 😎👍👍"
  },
  {
    "id": "Ugx9TvffWQf5ckSX2mp4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I actually paused this episode and viewed the previous episode, upon your recommendation. Gold star, please and thank you. ⭐"
  },
  {
    "id": "Ugw5xmdRCad04OwhiXh4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I’ve learned so much from this channel - thank you."
  },
  {
    "id": "UgzNfM96qCjEWmWM7hV4AaABAg",
    "publishedAt": "1 year ago (edited)",
    "text": "I'm amazed all these bare masses aren't grounds for demonetization 😅😂"
  },
  {
    "id": "UgzyS4SVg-8enTMDOV94AaABAg",
    "publishedAt": "1 year ago (edited)",
    "text": "Feynman, Schwinger and not to be forgotten Tomonaga ..."
  },
  {
    "id": "UgzNJktqtJIGGfHX4Nl4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I think every mathematician had a migraine when he said \"infinity minus infinity-minus-one equals one! No problem!\" No problem? We're subtracting one from infinity now and acting as if that's not the most wrong thing ever. Obviously this isn't math, this is physics where this sort of thing makes sense and you can't even compare \"infinity\" in physics with \"infinity\" in math, I still find it funny though. 🤣"
  },
  {
    "id": "UgxmpaswAGxY-EqFb6x4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Fantastic video, as always! Super great explanations here!"
  },
  {
    "id": "Ugy3NahlVDde5_TKIT94AaABAg",
    "publishedAt": "1 year ago",
    "text": "\"This is infinite. That is infinite. Out of That infinite manifest This infinite. Substrate This infinite from That infinite, Infinite alone remains.\" - Upanishads"
  },
  {
    "id": "Ugz-LlpBpkkzpuHIqCZ4AaABAg",
    "publishedAt": "10 months ago",
    "text": "This is my favorite channel on YouTube ❤"
  },
  {
    "id": "Ugz0qsfx0tJ-LNjyPxV4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I got lost right around 13:44 where it feels like it glosses over the key point. I think it's because I don't fully grasp the concept of self-energy. So the virtual positrons perfectly cancel out the electrons but then where does the mass come from and why/how does it scale with the bare mass? What is meant by first and second order in this context?"
  },
  {
    "id": "UgxOLg9LkfWv9mO5sYt4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Pretty cool, I'm studying this at the moment and your videos are a nice recap when you haven't seen this stuff in a while"
  },
  {
    "id": "UgwtWFV-gP6c6hV5LVl4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Thanks guys these last two episodes have been really insightful ❤"
  },
  {
    "id": "UgwnAsXn9AL3Y48Xx7V4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I don't understand sh*t. I use this channel as ASMR."
  },
  {
    "id": "Ugw2e5XY_P4tLGQ1gUt4AaABAg",
    "publishedAt": "1 year ago",
    "text": "PBS Space Time always asks the question no one else would"
  },
  {
    "id": "UgzH9RsAeEHllWvMq0Z4AaABAg",
    "publishedAt": "1 year ago",
    "text": "So if you add a whole pie to my belly then take away my appetite that somehow equals happiness? I approve of this math."
  },
  {
    "id": "UgxVrQcPlFBjf7TWp5N4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Absolutely freakin awesome video"
  },
  {
    "id": "Ugy1vfkL-SjIKebbISZ4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Good to know every electron in my body annihilates with antimatter 10^17 times per second. 😅 Almost makes one think of particles less as discrete entities, and more as relational distributions of charge; eddies in \"the black sea of infinity,\" as Lovecraft put it."
  },
  {
    "id": "UgzpJ6mGKwTcdzD4MBl4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Here is my, hand wavy, alternative approach. Actually I expect that this has been investigated before and proved wrong or irrelevant. But having someone explain the problems with it would be enlightening. First take the particle like properties to be purely a function of interactions. So we can ignore them when considering a single particle. This leaves you with a field with a large mostly stable wave and a lot of unstable small fluctuations. The mass is the mass energy of the large wave. This should be a small finite value that will vary slightly as it interacts with the small waves. The observed mass is function of the wave mass and the interaction mechanism. Since the wave is not a point and is continuously being modified by the fluctuations in this field and probably other fields as well, we get the quantum weirdness that we observe. The descriptions I have seen are mostly consistent with this. But they then seem to force the \"particle\" concept onto the waves. Doing this seems to lead to some of problems in the math. Hopefully my ramblings make some sense. If any experts can help enlighten me on the subject, I would really appreciate it."
  },
  {
    "id": "UgwF2EWSAFsKqth8w8p4AaABAg",
    "publishedAt": "10 months ago (edited)",
    "text": "This is the most abstract, complex, baffling concept I’ve ever tried to comprehend.🤯"
  },
  {
    "id": "UgzsJdvkOS4C2GgGr6t4AaABAg",
    "publishedAt": "1 year ago",
    "text": "\"Wait it's all infinite?\" \"Always has been\""
  },
  {
    "id": "Ugz6ZFJwLQATL2HGjkd4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Thank you. Outstanding presentation. Bravo!"
  },
  {
    "id": "UgwMyI2NjWZ0syu7u-B4AaABAg",
    "publishedAt": "1 year ago",
    "text": "How many of you also try to anticipate when Matt is going to end the video with \"space time\"? 😂"
  },
  {
    "id": "Ugz_pPTJMDC_Mew94cV4AaABAg",
    "publishedAt": "1 year ago",
    "text": "This week in 'Maths that don't make any sense'."
  },
  {
    "id": "UgzUgmi7qP2amvPhJ_t4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I got to chat with Freeman Dyson for a few minutes at a book signing."
  },
  {
    "id": "UgxHlId076CSoXxCfPx4AaABAg",
    "publishedAt": "9 months ago",
    "text": "Now that’s a title"
  },
  {
    "id": "Ugy4mc3yJ_aeLftxRVx4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I am coming to believe (possibly because I don't understand something) that the idea of measurement is itself flawed. It's like in order to refer to any event or object in the spacetime continuum, we can use measurement because in the continuum itself (which we, the measured event and the measurement devices are) those measurements results remain consistent across time. When we get in deeper and start asking about the actual nature of the events or the continuum itself, the order of the questions the measurements are asking matters to the consistency of the results. So essentially, I believe science is the best possible way to describe the continuum, but it's reliance on consistency in measurement results regardless of order of questions asked is screaming that some updated idea of measuring or a separate domain of logic that undermines how we think of measurement is what rules the nature of reality itself. Measurable results are themselves emergent properties of a nature that can't be measured without context of the measurement parameters already existing to begin with. By the time you're measuring, you're part of the measurement, so the underlying nature of the emergent measurable universe remains beyond measurable results. It's like the true nature of reality is everywhere you look, but nowhere you dig into it. And that is why physics breaks down at certain points. It's essentially trying to apply \"continuum logic\" to something that the continuum doesn't apply to. Please correct me if you understand better than me. Im happy to research anything I'm pointed towards."
  },
  {
    "id": "Ugw5JC9-ruRArU3FV4J4AaABAg",
    "publishedAt": "1 year ago",
    "text": "this channel does not miss"
  },
  {
    "id": "UgyIG1pWpyC9zg-DBWF4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I'm slightly disappointed you didn't mention Feynman calling renormalization a \"dippy process\""
  },
  {
    "id": "UgyVzK9poHCzABaGvV94AaABAg",
    "publishedAt": "1 year ago",
    "text": "I need a gif of that \"woohoo\""
  },
  {
    "id": "UgyVbx8og_a3BPb2UxV4AaABAg",
    "publishedAt": "1 year ago",
    "text": "0:51 are you saying the higgs mass should be MASSIVE?"
  },
  {
    "id": "UgweZVm1KJDTc__E3p14AaABAg",
    "publishedAt": "1 year ago",
    "text": "Big numbers like these are very often similarly calculated in superposition method of calculating electric circuits"
  },
  {
    "id": "Ugzezz_BaQeLsnV4ggp4AaABAg",
    "publishedAt": "1 year ago",
    "text": "6:09. Matt almost coming to tears due to physicists' current inability to solve this problem for the Higgs Boson."
  },
  {
    "id": "UgzA5mDW5wh8WgryTL14AaABAg",
    "publishedAt": "1 year ago",
    "text": "You get a Sophon. Obviously. 😉"
  },
  {
    "id": "UgwXy__ZqgbWTrZVkmZ4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Magnificent video! Thank you!"
  },
  {
    "id": "UgwVZesKyjNGwMcQFV14AaABAg",
    "publishedAt": "1 year ago (edited)",
    "text": "All the hand wringing about infinites in QFT is frustrating. We have no problem accepting the results from complex analysis that are well characterized (integrating around poles, conformal maps integratd at the boundary, etc.). None of this stuff, strictly speaking, is always explicitly necessary in many problems... these techniques merely make the mathematics easier to work with, but even without it, you can nearly always get a solution or an approximate solution that's \"good enough for calculus\" once you factor in considerations like error convergence, analytical functions, or bounded terms... and good enough for calculus is often good enough for chonkier things like the universe or uncooperative parameterized functions defined on stuff as gossamer and deformable as spacetime (and if quantum mechanics and information theory viewed through the lens of Neother offer any hints, all that REALLY matters here is the algebra of conserved quantities and abstract symmetries outside the context of realism or representation). Up until now the infinities are usually artifacts of embeding these symmetries into an unnatural artificial linguistic or computational system (ie explicit parameterized REPRESENTATION). It's the mathematical \"technology\" not the universe, or the current understanding of physics that's the real issue here."
  },
  {
    "id": "UgzwAQvl07IoOdlJEp14AaABAg",
    "publishedAt": "1 year ago",
    "text": "whew, that one took a couple of watches! Still don't fully understand a lot of it, but the Feynman diagrams really helped."
  },
  {
    "id": "UgwROBiuzDayVqU5yrB4AaABAg",
    "publishedAt": "1 year ago",
    "text": "∞ - (∞ - 1) = 1 ... BOOM! Where is my Nobel?"
  },
  {
    "id": "UgxpeIjJRZ45m-jPSmF4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I think that quantum and classical eoectromagnetism predicting the same infinities on the point like scale is a good showcase of the theories converging."
  },
  {
    "id": "UgwayKWETr9WwEdssIx4AaABAg",
    "publishedAt": "1 year ago (edited)",
    "text": "Mathematically-speaking, you have to be careful with applying arithmetic operations to infinities, bc not all infinities are the same size. Some infinities are larger than others; so, 00-00 often ≠ 0 (and, given that 00 isn't actually a number, the \"value\" 00-1 is utterly meaningless) That being said, \"infinities\" in pure mathematics refers to infinite numerical sets (which explains why there can be comparative infinities larger and smaller than others); whereas, in the context of the problem presented here as a mathematical descriptor for the electron (via QM), we very likely don't have to concern ourselves with different sizes of different infinities, because we're dealing with a singular value assigned as infinity presented twice (with opposing polarities*)"
  },
  {
    "id": "Ugx-8sVgBHXubOA6xOh4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Matt, when you're sick, take a break. We can handle it"
  },
  {
    "id": "Ugzku6N-jD_C69uPEzh4AaABAg",
    "publishedAt": "1 year ago",
    "text": "It feels so wrong to use virtual particles as a solution to our problems. It just feels like a way to explain what’s happening without having a good understanding of the truth."
  },
  {
    "id": "UgyVJMo8ms9zybcSpnN4AaABAg",
    "publishedAt": "1 year ago (edited)",
    "text": "Yes! I had to rewind to check that Matt really did look at his wrist without a watch! 😂"
  },
  {
    "id": "Ugw1NTQ0shS-bdwufOx4AaABAg",
    "publishedAt": "11 months ago",
    "text": "Ive been watching this for so many years you are my comfort animal thank you for years of dedicated service."
  },
  {
    "id": "UgzrakTAfuWh6K02Ey94AaABAg",
    "publishedAt": "1 year ago",
    "text": "who is the bigger idiot, the person who purposed this formula or me for thinking the person who purposed this formula is an idiot?"
  },
  {
    "id": "UgzGptiOgFGh0rOKXml4AaABAg",
    "publishedAt": "4 months ago",
    "text": "This is an amazing program! Thanks You for planting the ground for my molecular biology clases"
  },
  {
    "id": "UgxvzGIvJvDu_8vEJVN4AaABAg",
    "publishedAt": "1 year ago",
    "text": "9.5k views in 30 mins? That's a lot of electrons"
  },
  {
    "id": "UgzH2SI0EEVOHgJOi5h4AaABAg",
    "publishedAt": "1 year ago",
    "text": "“What’s an infinity between friends? So let’s get rid of those…”"
  },
  {
    "id": "UgwHX7c8e4pPzRN6__94AaABAg",
    "publishedAt": "1 year ago",
    "text": "If the universe is infinite in all directions, then i declare : i am the center of the universe right now ! And for all my life ! … prove me wrong 😅"
  },
  {
    "id": "Ugzkwh8OZR749gr7muJ4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Thank you for giving me a refreshing new & better appreciation for the incredibly teensy-weensy, tiniest scale of the electron & it's friends."
  },
  {
    "id": "UgySfpzUf1RRZEBjI0p4AaABAg",
    "publishedAt": "1 year ago",
    "text": "My current bank account balance is a negative infinite balance + a positive infinite balance + my current balance"
  },
  {
    "id": "UgxY6W5aVrwZGz9iyZh4AaABAg",
    "publishedAt": "1 year ago",
    "text": "one electron universe going strong!"
  },
  {
    "id": "Ugy_uXWukJkHltdGqRh4AaABAg",
    "publishedAt": "1 year ago",
    "text": "physicists are the kinds of people who wouldnt mind if the universe was destroyed as long as it makes their theories simpler."
  },
  {
    "id": "UgyFJ4AzJuPSdVQzQm14AaABAg",
    "publishedAt": "1 year ago",
    "text": "4:44 I can feel the mathematicians twitching from here!"
  },
  {
    "id": "Ugy4mahbybrCs1q2mml4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Everything stops making sense when you play around with infinity. Infinity isn't a number yet math and science types love to treat it like it is. It's a concept and an abstract one at that. . I feel infinity & numbers is like apples & oranges. Just because apples and oranges are both fruits you can't establish any sort of objective valuation of the two in relation to each other. In other words, you can't prove X amount of apples is equal to Y amount of oranges. . In the same way you can't mix infinity in with numbers just because it's a numerical concept."
  },
  {
    "id": "UgyoapI0uxUIf1rAygN4AaABAg",
    "publishedAt": "9 months ago",
    "text": "The is probably just small because it's cold."
  },
  {
    "id": "UgydEN097_omj_ZwcAZ4AaABAg",
    "publishedAt": "1 year ago",
    "text": "If the hierarchy problem is problematic, just dox it and write emails to its boss with false allegations of racism and sexism. Or any other form of fascistic social pressure should also do…"
  },
  {
    "id": "UgwRbBC2ZXq7V4gwhSt4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Can I offer you an electron in these trying times.."
  },
  {
    "id": "Ugytb46uSdgD3tBMYfZ4AaABAg",
    "publishedAt": "1 year ago",
    "text": "This tile is exactly what Fubini’s theorem tries to prevent😢"
  },
  {
    "id": "Ugw6Tf6DAPDoYHhFukx4AaABAg",
    "publishedAt": "8 months ago",
    "text": "I love how you present the ideas. It fires one's imagination, i.e. How could something have mass and not take up 'space'? It's like a mirage."
  },
  {
    "id": "UgyyFewYheLf0VNhxZR4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Mind blowing stuff!"
  },
  {
    "id": "Ugy0Fz5WOf-J09lNUPN4AaABAg",
    "publishedAt": "1 year ago",
    "text": "This is fascinating stuff"
  },
  {
    "id": "UgyR8c51U1Y7uvOxGFl4AaABAg",
    "publishedAt": "1 year ago",
    "text": "As written, this equation equals zero. (Infinity - 1) is infinity. Infinity - infinity is zero."
  },
  {
    "id": "UgzuQagQsGchyzgfD0Z4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Such a great video! I didn't learn this in either my particle physics nor QFT class. But you gave such a clear explanation of how this works. Thanks!"
  },
  {
    "id": "UgxxLkHbGc60IVYgsZh4AaABAg",
    "publishedAt": "1 year ago",
    "text": "And now there are fractional electrons from the peer-reviewed paper using 5 graphene sheets."
  },
  {
    "id": "Ugw2Et5_0a23vDaRrzV4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Life comes from an infinitely small Spark but leaves behind an infinitely large wake..."
  },
  {
    "id": "UgzcO2d7smc9dmucLNp4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Infinity minus infinity is an indeterminate form."
  },
  {
    "id": "Ugy3mtZs9eBBDJFQjPR4AaABAg",
    "publishedAt": "10 months ago",
    "text": "The bgm playing in the beginning makes it hard to sleep."
  },
  {
    "id": "UgzokJyjhpEZd0yimlh4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Amazing how renormalization aligns theoretical predictions with observations. It’s a striking example of how physics bridges abstract math with empirical data."
  },
  {
    "id": "Ugx1wyXeahTX5FOqbop4AaABAg",
    "publishedAt": "6 days ago",
    "text": "Infinitely massive information"
  },
  {
    "id": "UgyR2d2AYnIt1wF1O6N4AaABAg",
    "publishedAt": "1 year ago",
    "text": "This will be incomprehensible."
  },
  {
    "id": "Ugy6sfF8kkZwwBB-BSR4AaABAg",
    "publishedAt": "1 year ago",
    "text": "9:39 - So if it's a pinpoint of infinite energy does that make electrons tiny black holes, also explaining why they all look identical? 🤔🤔"
  },
  {
    "id": "Ugw0weUa24KQObHTeY94AaABAg",
    "publishedAt": "1 year ago",
    "text": "I'd go insane only ever thinking about theoretical stuff that's impossible for us to see."
  },
  {
    "id": "UgynegP5dg0rWdkCAXx4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Calibrating to reality is a parlor trick. Just means you know the answer, and you Jerry rig the question to ensure that result."
  },
  {
    "id": "Ugz6csU7iOefYgtaMy14AaABAg",
    "publishedAt": "1 year ago",
    "text": "This will be great for my kids grade 1 home work"
  },
  {
    "id": "Ugy0lMlCA0tz1oEKoEJ4AaABAg",
    "publishedAt": "1 year ago",
    "text": "This renormalization sounds like a gauge group since it involves some symmetry and can counteract the Lagrangian. Chiral symmetry conserving mass also sounds like Noether’s theorem."
  },
  {
    "id": "UgzoYkqNyNydl7DMl-54AaABAg",
    "publishedAt": "1 year ago",
    "text": "Remember that when you die, all of this will be on the test."
  },
  {
    "id": "UgxuTUpwOQNhYSE8U2l4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I'm really excited about the next episode and I'm wondering if the next disvovery of the LHC will be the particle that \"protects\" the Higgs!"
  },
  {
    "id": "UgwA0nrXjs1MjlpcPBF4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Speed of light is finite, so maybe we can have a black hole that has big mass, but not singularity. Maybe we got singularity wrong in the first place."
  },
  {
    "id": "Ugy0LtJVuZN__mAA45N4AaABAg",
    "publishedAt": "1 year ago",
    "text": "When a finite amount of mass meets infinite probability..."
  },
  {
    "id": "UgyqzuLpLsLOeb48hjJ4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Was expecting -1/12 to come to the rescue. Disappointed it didn't make an appearance."
  },
  {
    "id": "UgxI5v3PYE06F-TcPWt4AaABAg",
    "publishedAt": "1 year ago",
    "text": "It seems like a fine tuning. But it just indicates an undiscovered mechanics who defines the particles properties."
  },
  {
    "id": "UgyzivqRC9X6KsABnAB4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Unfortunately, zoophysicists have yet to design an apparatus with sufficient energy to capture negative bears, so we've been unable to measure the negative bear mass."
  },
  {
    "id": "UgzcVEaXKDdIO88Jdjt4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Finally something we can all agree on!"
  },
  {
    "id": "UgzKaXtdJLvC0GYLMXJ4AaABAg",
    "publishedAt": "11 months ago",
    "text": "Happy new year"
  },
  {
    "id": "UgwPpHpirwAghcNyXtd4AaABAg",
    "publishedAt": "1 year ago",
    "text": "In 2009 Mikhail Shaposhnikov and Christof Wetterich estimated the mass of the Higgs using (a more worked-out version of) Weinberg's Asymptotically Safe Gravity (ASG). They predicted it to be 125GeV +/- 2.2 GeV. In 2012 the Higgs was found, with a measured mass of 126GeV +/- O.15 GeV. It seems that the Higgs' Hierarchy problem has been solved already? We can calculate the mass of the Higgs using ASG!"
  },
  {
    "id": "UgxtJunwjzIzPc7wxL14AaABAg",
    "publishedAt": "1 year ago",
    "text": "At 4:09 the electron mass stated is OFF BY A FACTOR OF 1000 since the units given we eV but should have been keV. Whoops!"
  },
  {
    "id": "UgyCiJycjnvEYFp1WER4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Normalization in electrical/computer engineering makes things so much easier. It's basically the best way to approach any theoretical calculation."
  },
  {
    "id": "Ugw6pUTSAtKjWe11Ud94AaABAg",
    "publishedAt": "1 year ago",
    "text": "Get well soon Matt"
  },
  {
    "id": "UgyRTaXhs2w2lOPRnPN4AaABAg",
    "publishedAt": "1 year ago",
    "text": "rest mass of electron is .511 MeV or 511 keV, not eV"
  },
  {
    "id": "UgwWhFG9vNK8ztFGgqV4AaABAg",
    "publishedAt": "1 year ago",
    "text": "The timing of the radioactive tracker ….."
  },
  {
    "id": "UgyFLAncbCdZDLTxV494AaABAg",
    "publishedAt": "11 months ago",
    "text": "I've watched nearly every PBS Spacetime video and I've watched this one about 5 times and I still don't get it, guess I'll watch it again"
  },
  {
    "id": "Ugz2wsH5qNK971ScmSV4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Eddy calculated that the chance of picking up Arthur and Ford was infinity minus one 😊"
  },
  {
    "id": "UgwXpxJZTz72EhTTyfR4AaABAg",
    "publishedAt": "8 months ago",
    "text": "watching this on 420....what a ride"
  },
  {
    "id": "Ugyb-4RCXbsm4R7c9lN4AaABAg",
    "publishedAt": "1 year ago",
    "text": "The way renormalization has been described here looks like just using the fact that for any divergent series with infinite positive and negative contribution where the sequence still converges to zero, you can rearrange the terms to make it sum to anything. Why wouldn't be exactly what's happening here, where we choose this \"anything\" to be the observed electron mass? If that's the case, the actual solution provides an order that makes physical sense. So if renormalization works, but we don't have a solution, wouldn't it just mean that we don't know why the \"right\" order of terms physically makes sense? (or even precisely which one it is)"
  },
  {
    "id": "Ugy6Of1c4SZ40lLkLXZ4AaABAg",
    "publishedAt": "1 year ago",
    "text": "All the electrons got a headache trying to understand this, so they decided just to get on with being. The universe was very grateful."
  },
  {
    "id": "UgxT90d1goiPRELErgt4AaABAg",
    "publishedAt": "1 year ago",
    "text": "The thing I don't like about using infinities is that there are many types of infinity."
  },
  {
    "id": "UgzvdfC3I9E9xywSICZ4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Got it, thanks :)"
  },
  {
    "id": "UgwnedP-2w21yudD5nd4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Fascinating!"
  },
  {
    "id": "UgxaVf1s7va5Tq_mL6x4AaABAg",
    "publishedAt": "7 months ago",
    "text": "Man that really does sound like a nonlinear field interaction more than a particle"
  },
  {
    "id": "UgwHnYDCTjw7pO43U4h4AaABAg",
    "publishedAt": "1 year ago",
    "text": "A better adjective than \"dressed\" must exist."
  },
  {
    "id": "UgxZ91BJRRyYktqYG-t4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Excelente Matt"
  },
  {
    "id": "UgygSzQVeDIWJNO6zIl4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I have one thing to say: WHAT?!"
  },
  {
    "id": "UgwsLuFLlnyn54UmbTl4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I think it could seem more intuitive a concept if you think of negative mass as like an inversion of the mass. Like maybe the virtual representation of the way time space stuff curves around the subject of study."
  },
  {
    "id": "Ugz0xo1fj5YGCY_O3Yt4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I'm pretty happy with my Ludlum Model 3. Though that fancy pants gadget does have some nice features."
  },
  {
    "id": "UgwQYDHVbMVAVSXMjqJ4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Really excited for this series of topics, we're going deep! In materials for laypeople I usually encounter renormalization just as \"a thing you gotta do\" and even working (experimental) physicists and physics students I meet seem mostly uninterested in examining the underpinning philosophy. I have too many times heard the idea that quantum mechanics is just the math and if the math works that's the reality. But it so clearly isn't how any of the first couple generations of quantum physicists thought, and this video so clearly demonstrates why poking at the mathematical philosophy gets us closer to understanding reality! Love it."
  },
  {
    "id": "Ugwn4OAbFiooJqaxQFB4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Oh my his voice on utopia Focal ,wow"
  },
  {
    "id": "Ugxz5xeL5uo2xBcZ9SV4AaABAg",
    "publishedAt": "1 year ago",
    "text": "In your future video on higgs mass, I wonder if you could address the relation between the Higgs fields and infinite vacuum energy?"
  },
  {
    "id": "UgzfbeAonPwA-KCJgql4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Display the motion as frequency and vibration and you'll have a visualization that will help grok the maths."
  },
  {
    "id": "Ugx6XNkoyA9PBqwgTRh4AaABAg",
    "publishedAt": "1 year ago",
    "text": "This occurs because not all infinites are similar. Infinity is not everything."
  },
  {
    "id": "Ugy4H1KTjqlFN4_y4cF4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I could've sworn that those virtual particles would save the day for the electron! 😄"
  },
  {
    "id": "UgxnfoRefJ17SaFj7RR4AaABAg",
    "publishedAt": "1 year ago",
    "text": "excellent episode. i got the basic principle now, but to truly understand it, i think i need some maths to back that up. but hey there are worse ways to spend what could have been a night of good sleep other than a deep dive into the maths of the hierarchy problem."
  },
  {
    "id": "UgzAYDNFcKuPPBkUIpF4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Honestly, this is a rather well-put higher explanation of \"why out of necessity\" are we sweeping the energy infinities under the rug and letting them be. All the while looking at the post-renormalization energies...and somehow we are calibrating or reassessing under our current reality. It's like you have to ask the universe what you are looking at while ensuring your reality of measurement is also accounted for before the universe teases you with a truth or novel finding."
  },
  {
    "id": "Ugzj-4Bl2vqmuDDXB9l4AaABAg",
    "publishedAt": "11 months ago",
    "text": "These videos are the best to fall alseep to because never in 10,000 will i need this information so i can let it all drift peacefully over my head, just like in highschool"
  },
  {
    "id": "UgyKLoc7BlVk3pL8nx54AaABAg",
    "publishedAt": "11 months ago (edited)",
    "text": "We are all just one electron in some amazing boundary conditions."
  },
  {
    "id": "UgyyrJssDe3bCEirHsx4AaABAg",
    "publishedAt": "1 year ago (edited)",
    "text": "Problem in QFT. Solutions: break diagram, calibrate reality. Check!"
  },
  {
    "id": "Ugzi_i2PN0qvzRUUJot4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I used the stones to destroy the stones."
  },
  {
    "id": "UgxNRr4gY8LPTrRn12h4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Love the content as always... but radiacode man... is that the app from Mission Impossible: Fallout? ;)"
  },
  {
    "id": "UgzbJQ1hBi8GH82nbA14AaABAg",
    "publishedAt": "1 year ago",
    "text": "Infinity minus one is still infinity, so infinity minus that is the same as infinity minus infinity and the result of that can be anything,"
  },
  {
    "id": "UgxyL5ak2H7eBWKAcZB4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Cool 😎 maybe revisit basic quantum field theory and how to all the possibilities sum up to the total again? Virtual particles are super weird"
  },
  {
    "id": "UgwZMCzzXMzKAAl7L814AaABAg",
    "publishedAt": "1 year ago",
    "text": "Thank you"
  },
  {
    "id": "Ugy7Jc4dd6tiBSDCoht4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Hi Dr. O'Dowd! Renormalization seems unsatisfying, even if it's relatively useful. But for some reason, I can't stop thinking about taking the integral of an infinite polynomial and setting x equal to 0. All the higher-order craziness vanishes and we're left with just the constant of integration. Even if that constant is small or seems strangely fine-tuned, no other terms needed to magically cancel out to produce it. We're still calibrating the constant to reality, but there's nothing weird about it."
  },
  {
    "id": "UgxmhJ1CAqVOWBLvSU14AaABAg",
    "publishedAt": "1 year ago",
    "text": "Hegel would have loved quantum physics!"
  },
  {
    "id": "UgyJvd49fnqcJvzJ9694AaABAg",
    "publishedAt": "1 year ago",
    "text": "Ooh, dis gun be fun."
  },
  {
    "id": "UgwvuefFM9PPHet2Bb14AaABAg",
    "publishedAt": "1 year ago",
    "text": "If matter is mostly empty space? Yes"
  },
  {
    "id": "UgxIoQSL5lgyBibIk1J4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Could the negative mass be the potential of quantum fluctuations due to entanglement? The Highs Boson could interact before mass is actually converted."
  },
  {
    "id": "UgwaHNH2z7XK2gUyT9B4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Almost sounds like a repeat of the ultraviolet catastrophe. Need a new constant? Vacuum energy constant? Holds everything with a mass less than a neutron together by random interaction, sort of holding the 'energy/mass' into one area of space."
  },
  {
    "id": "UgzVzSr4ARnWl-iqYEd4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Looking good, Matt."
  },
  {
    "id": "UgyLseXKODxHzVVktZx4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I got sad once i realized you werent saying Bear Mass"
  },
  {
    "id": "Ugx5mPX4z6VOwOqKDZ54AaABAg",
    "publishedAt": "1 year ago",
    "text": "Finally finished with my exams, still haven’t gotten enough of physics though :P not that videos like this really resemble courses at all though haha"
  },
  {
    "id": "UgxWj8TlwQ71IYLwWdt4AaABAg",
    "publishedAt": "10 months ago",
    "text": "I did not know the electron and positron had chirality. I thought the only difference was charge. I still don't really understand what the chirality means with them. It's not the spin but the direction of the spin? Like clockwise and counter clockwise I think?"
  },
  {
    "id": "Ugxc23c-OL7uB8c7yPx4AaABAg",
    "publishedAt": "11 months ago",
    "text": "What part of an electron interacts with the Higgs field? An electron has mass ergo it interacts with the Higgs field."
  },
  {
    "id": "UgxbzP5OOS3F9s4Uw0R4AaABAg",
    "publishedAt": "5 months ago",
    "text": "The idea of \"infinity minus infinity\" is a great reminder that infinity isn’t a number, but a concept. It’s fascinating how quantum field theory deals with these infinities—subtracting infinite quantities in such a way that what's left is something physical, like a single electron. That subtle difference—between subtracting meaningless infinities and extracting physical predictions—is what makes renormalization so brilliant ..."
  },
  {
    "id": "Ugwr56x5kZTCuCr5K714AaABAg",
    "publishedAt": "9 months ago",
    "text": "What about a positron? Negative infinity minus negative infinity?"
  },
  {
    "id": "Ugxjgx_72cybGnaNd2h4AaABAg",
    "publishedAt": "6 months ago",
    "text": "Yes, that's correct! The Millikan oil drop experiment was conducted by Robert A. Millikan in 1909 to measure the elementary electric charge, i.e., the charge of a single electron."
  },
  {
    "id": "UgyIvW7tTzUb22KJ-7h4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Sometimes infinity is negative infinit. Sometimed it's 1. Sometimes it's -1/12. It depends on what the Party says, Winston."
  },
  {
    "id": "Ugymx3s3dN3__Hzlp7x4AaABAg",
    "publishedAt": "1 year ago",
    "text": "In the text box under \"Renomalization\" is the phrase \"the theory of self-similar geometric structures\". That sounds intriguing. Where might one learn more about this (particularly in the context of renormalization) ?🤔?"
  },
  {
    "id": "UgwjzqIjvN9EBbfESwN4AaABAg",
    "publishedAt": "1 year ago",
    "text": "\" In theory, theory is as good as practice. In practice, it isn't. \" Yogi Berra."
  },
  {
    "id": "UgzXQABzAWhdmMOe5x54AaABAg",
    "publishedAt": "1 year ago (edited)",
    "text": "Can you talk more about the chiral symmetry"
  },
  {
    "id": "UgwZ9iwc6_jtmJ49o8d4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I would think that infinity minus infinity would equal a photon."
  },
  {
    "id": "UgyofAogbPUAvfVPxcl4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Ripples on the shore of the dirac sea."
  },
  {
    "id": "UgyHowS6iqY-ilkt7Sl4AaABAg",
    "publishedAt": "1 year ago",
    "text": "This is why in the morning when I hit the snooze button it should be five minutes but is really two seconds. I tell my boss I was caught in an undetermined state until I was observed. That’s why I’m always “late”."
  },
  {
    "id": "UgwLalPBGhkiEOZevtd4AaABAg",
    "publishedAt": "11 months ago",
    "text": "Our world is beyond describable. Do a video on the first image of a photon. Tell me, how can it have any mass yet move at light speed? This breaks physics."
  },
  {
    "id": "UgwdtCOJIRjRQGI3oyN4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Better title. Well played."
  },
  {
    "id": "Ugy619y-MpvSlHYmTNV4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Is zero multiplied by infinity maybe .... something ?"
  },
  {
    "id": "UgzSUmsfywlWc-Y5_ix4AaABAg",
    "publishedAt": "1 year ago",
    "text": "4:08 511 eV seems missing a factor of 1000"
  },
  {
    "id": "Ugyiw-6bioj-2Qpf8Ot4AaABAg",
    "publishedAt": "1 year ago",
    "text": "To answer your question at the beginning, you get a crowbar, an HEV suit and an opening to another dimension."
  },
  {
    "id": "UgxEUbuD04OiaZtIiSR4AaABAg",
    "publishedAt": "1 year ago",
    "text": "Which part of the mass equation includes the Higgs interaction?"
  },
  {
    "id": "UgxoEvGmL4MTD-wqI4B4AaABAg",
    "publishedAt": "1 year ago",
    "text": "I just have this thought I haven't worked out all the way yet but it has a feeling of infinite energy field underlying all of reality and the electron is a point access to this infinite energy. I'm having a difficult time picturing how this same principle would work with the Higgs boson."
  }
]
