[
  {
    "id": "UgxoqsMSWKEAlqyZ3aF4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Support this channel by subscribing here 👉 links.profgmedia.com/youtube-prof-g-sub Sign up for our No Mercy/No Malice Newsletter here 🤘 links.profgmedia.com/nmnm-yt-comment"
  },
  {
    "id": "Ugwd-V_jrQzEGUknoyx4AaABAg",
    "publishedAt": "4 months ago",
    "text": "\"A third of America would kill another third while the other third watched\" is so disturbing and true"
  },
  {
    "id": "UgzkRPui9PGTpnwVnu94AaABAg",
    "publishedAt": "4 months ago",
    "text": "“ Israel doesn’t have a brand problem, it has a reality problem”…that’s gold"
  },
  {
    "id": "Ugx-f_3LR-IFaRjyDOx4AaABAg",
    "publishedAt": "4 months ago",
    "text": "i see israel and scott galloway in the same sentence, i run away"
  },
  {
    "id": "UgxrqZH3ARaHXpwIjod4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I don't think I've ever seen Scott listen this hard before.🙂 What a great conversation. I think it might be a keeper. Thank you."
  },
  {
    "id": "Ugyny5RvfzP-pHI4yYZ4AaABAg",
    "publishedAt": "4 months ago",
    "text": "appreciate Ezra's moral clarity, \"this is not a brand problem, it's a reality problem.\" Wake the F%$@ up Scott! You've been wrong about this admit it and get on the right side of history."
  },
  {
    "id": "UgweunEaIIVyuqeGCQZ4AaABAg",
    "publishedAt": "4 months ago (edited)",
    "text": "Ezra destroying Scott’s perceptions on Israel so thoroughly he changed the subject is something he needed. Love you Scott but this continued defense of Israel’s war crimes is baffling."
  },
  {
    "id": "UgyFHhVet_IjthRo1Bp4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Scott did this interview flawlessly, allowing Ezra to make his points without petty interruptions. His tribute to Ezra at the end was gracious, and well deserved. Klein’s frankness about Gaza was deeply appreciated; I hope Scott will give this some thought."
  },
  {
    "id": "UgyDBIxWZvOWOfjTzQ94AaABAg",
    "publishedAt": "4 months ago",
    "text": "James Talarico is very authentic and is an excellent communicator !"
  },
  {
    "id": "UgxBmHnGuSH7fvbEXqt4AaABAg",
    "publishedAt": "4 months ago",
    "text": "As a non-American, I am amazed that America, the most wealthy country, does not have universal health care coverage. It goes a long way to explain why Americans have a negative attitude towards their government."
  },
  {
    "id": "Ugz580X11-FbNn6SBWR4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Watching Ezra stand up to Scott on Israel in this conversation just made me a life long fan."
  },
  {
    "id": "UgwgOOuxBvk__hREjlp4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Parenting yourself was something I learned a couple of years ago. My children are grown and out of the nest but when I look back I see how I pushed myself too hard so I was always away and the when I came home I was too tired and not available for my them and their mother. I am 61 now and if you are reading this , trust me when I say being there for your family is the most important job you have in life. Be interested in their lives not just your own. It is key to how successful they will be later in their life."
  },
  {
    "id": "UgwalsUv_9PcC3ZQTud4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Absolutely incredible advice about family."
  },
  {
    "id": "Ugw4vOJathQztnvhDaJ4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Prof G. your focus on Gaza is more about bad PR for Israel and less about thousands of children being intentionally starved to death."
  },
  {
    "id": "UgykaKuCfIXvJ7Ph64J4AaABAg",
    "publishedAt": "4 months ago",
    "text": "That line about being motivated more by your sympathies then your resentments.,.. chef's kiss"
  },
  {
    "id": "UgwGpaHgbxXc8XQHqWd4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Loved this conversation!"
  },
  {
    "id": "UgzDGfzdS9NGnAqxNOB4AaABAg",
    "publishedAt": "4 months ago",
    "text": "My favorite 2! Yeah! Speaking to truths! More of this!"
  },
  {
    "id": "UgwTPhZ-H_EWZ3e6Dit4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Bro said Elissa Slotkin has authenticity hahaha"
  },
  {
    "id": "UgzPheukDobhbJwaSZl4AaABAg",
    "publishedAt": "4 months ago",
    "text": "BRAVO to the answer to the parenting question."
  },
  {
    "id": "Ugzw8Km6ozB2joL04lR4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Scott became melancholic when he could not find any argument to counter Ezra's points that Israel is straight up committing war crimes"
  },
  {
    "id": "Ugy1wQvFOB7gNHg2p6Z4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Thank you. Real for those who have no agenda."
  },
  {
    "id": "UgwCBBNandGH2lL2HFR4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Everytime Scott talks about Israel he loses 95 IQ points"
  },
  {
    "id": "UgyupXX0RmkkzzRHMhd4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Great conversation. Thank you!"
  },
  {
    "id": "Ugx4MV0JlnSGGyueSjV4AaABAg",
    "publishedAt": "4 months ago",
    "text": "The fact that you keep calling it a brand problem Scott is showing you do not understand the genocide that is taken place in Palestine gaza"
  },
  {
    "id": "UgzQcmdzYrpWNYHgjld4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I listened to this on your podcast. So great"
  },
  {
    "id": "Ugx2YS8AcW1aOqs5QfJ4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Images coming out of Gaza and news of people being shot trying to get food... makes one think of Schindler's List depiction of the Warsaw ghetto."
  },
  {
    "id": "UgwuR8UH24dBzn4TCLV4AaABAg",
    "publishedAt": "4 months ago",
    "text": "The US needs more than 2 parties."
  },
  {
    "id": "Ugy8V9jkwX6_6jRoQpJ4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Scott is a wonderful professor, marketer, and businessman. Like a lot of people who are good at some things, they often believe they’re right about more things. I hope this is a learning moment for Scott - as Ezra seems to be someone he respects."
  },
  {
    "id": "UgxQMMmkeh2PfUKjm614AaABAg",
    "publishedAt": "4 months ago",
    "text": "This is a very good conversation! Lots of insight!"
  },
  {
    "id": "Ugy4w29wVKlFhMDupG94AaABAg",
    "publishedAt": "4 months ago",
    "text": "Boy I like how Ezra came off in this conversation, very impressive"
  },
  {
    "id": "Ugy9bvJdQTpFw6W3s1p4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Three in the morning in NZ and I loved this content . Ta"
  },
  {
    "id": "UgxVKvqLXI3xsbyDAeJ4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Scott would argue that the Third Reich had a branding issue, despite the cool uniforms."
  },
  {
    "id": "UgwYNLVKidpaKw3RjD14AaABAg",
    "publishedAt": "4 months ago",
    "text": "Another great conversation. Two thoughtful people with humility."
  },
  {
    "id": "UgwmcUcbFzrJIK01Vxx4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Ezra is a great thinker and communicator. And so well informed."
  },
  {
    "id": "UgxZ1ERHmVyj2VIYbtN4AaABAg",
    "publishedAt": "3 months ago",
    "text": "Is it just me or are these the most calming voices ever. I'd listen to this if it was in a foreign language :)"
  },
  {
    "id": "Ugz0Sr4bSCM_NtDUwFF4AaABAg",
    "publishedAt": "4 months ago",
    "text": "The complete lack of empathy to Palestinians from Scott is just mind blowing. Not once was he able to manage thinking about the tens of thousands of people killed by Israel or the millions starved as anything but a PR and brand issue. Just disgraceful. Good job Ezra framing this as a moral issue."
  },
  {
    "id": "UgyYvGbcY5YsCRnyqNZ4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Love it! Huge fan of you both!"
  },
  {
    "id": "UgxrizrDl9qhT-_cT5B4AaABAg",
    "publishedAt": "4 months ago",
    "text": "No aspirational view of Brand Israel here in Australia I would say. I am surprised to hear that possibility - why would that be?"
  },
  {
    "id": "UgwUOjHyxzAoqkudNUl4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I love listening to smart and thoughtful people speak without ego."
  },
  {
    "id": "Ugytr5cBLivvlmIWlx54AaABAg",
    "publishedAt": "4 months ago",
    "text": "Scott you need to read a few books about the founding of Israel. It's always been on this trajectory."
  },
  {
    "id": "UgzMWzx35KV9kToKNKh4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Excellent ant candid conversation."
  },
  {
    "id": "UgzdDQRKEfWwT0fImel4AaABAg",
    "publishedAt": "4 months ago",
    "text": "What a great interviewee and interviewer. Scott asking a question and listening attentively and thoughtfully to Ezra. Brilliant from both of you"
  },
  {
    "id": "UgwRjmjIF21-6fZQJI54AaABAg",
    "publishedAt": "4 months ago",
    "text": "Two brilliant minds makes for an excellent conversation"
  },
  {
    "id": "UgwFZ3pPxgjCANECOgB4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Brilliant conversation. Klein is wonderfully articulate and Galloway at his best without the ghastly 'jokes' and wealth-boasting banter."
  },
  {
    "id": "UgwLGqGyEM4CzruXoeR4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Two of my favorites!"
  },
  {
    "id": "Ugw75YnP62x6CGwLCsl4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Much respect to Ezra for calling things as they are. Gaza’s children are being deliberately starved by Isreal, and you’re worried about Israel’s public reputation. That’s not just morally blind, it’s obscene. And your defense amounts to saying that if the United States can commit war crimes, then Israel should be allowed to as well. That isn’t reasoning. It’s complicity."
  },
  {
    "id": "UgyLtvn61N3TXS4Iqf94AaABAg",
    "publishedAt": "4 months ago",
    "text": "I love Ezza! Listen to him often!"
  },
  {
    "id": "Ugx4ouxu_CcORB1pmNh4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Mamdani having a weekly lunch with Bloomberg would absolutely destroy his credibility. Scott has absolutely zero political acumen, it's astonishing."
  },
  {
    "id": "UgxsMXUbaEAMENHe-wJ4AaABAg",
    "publishedAt": "4 months ago",
    "text": "It's all been said by others. Ezra is a revelation. Thank you for this."
  },
  {
    "id": "Ugy1RmiIIT9QDt_YvZd4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Liberal democracy can't survive in conditions of extreme wealth disparity. Those with such extreme power have no incentive to protect it. The way forward is massive wealth redistribution."
  },
  {
    "id": "UgxfrEK30D4vVLNLX6d4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Excellent Conversation"
  },
  {
    "id": "UgzfARWfXofieRGpWyN4AaABAg",
    "publishedAt": "4 months ago",
    "text": "'The brand is shifting' regarding a genoxide 😮😢"
  },
  {
    "id": "Ugyib1y13ClgYUCwH254AaABAg",
    "publishedAt": "4 months ago",
    "text": "The best take I've heard on Mamdani yet"
  },
  {
    "id": "UgxY_cAJ3oDLhVNWCQZ4AaABAg",
    "publishedAt": "4 months ago (edited)",
    "text": "Wooooow!! “Oftentimes people in politics they feel more motivated by who they hate, than who are in this for.” That is such a strong statement. You can see this ALL OVER the world today. Not just in the current political system in America. Great Interview Scott. Another win for ProfG!! 🥳🎉"
  },
  {
    "id": "UgySMXOgeouSrgqP_294AaABAg",
    "publishedAt": "4 months ago",
    "text": "Very imperfect gentleman Calm articulate and thoughtful Thank you from Australia I hope you end up getting a Better America"
  },
  {
    "id": "UgzU_-M3-RmNa1qJg1t4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Shout out to the comments for calling the host on his Israeli BS"
  },
  {
    "id": "Ugxr5IfK80ha2dlS8qF4AaABAg",
    "publishedAt": "4 months ago",
    "text": "🙌🙌🙌🙌🙌 The BEST interview"
  },
  {
    "id": "Ugynd03P2I8WPdlSb7R4AaABAg",
    "publishedAt": "4 months ago (edited)",
    "text": "\"Parenting yourself is hard....you poorly parent your child when you poorly parent yourself. Taking care of yourself, realistically, with dicipline, and it's hard\" I am paraphrasing but THAT was excellent. Thank you Ezra."
  },
  {
    "id": "UgzqKMIMF_-Kq4w4lnB4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Bingo! Two people in one podcast who understand themselves. I am getting ready to listen to it again."
  },
  {
    "id": "Ugx16Oz2v5FqN_l8i1J4AaABAg",
    "publishedAt": "4 months ago",
    "text": "How is Ezra such a deep and eloquent communicator? Truely amazing"
  },
  {
    "id": "Ugwxbj3jpkmOQu7Zwat4AaABAg",
    "publishedAt": "4 months ago",
    "text": "THIS is the conversation i needed"
  },
  {
    "id": "UgxFaywClPXNSzANvrh4AaABAg",
    "publishedAt": "4 months ago",
    "text": "The moment he said it was locker room talk and then it was okay , I heard what he said ,now I understand glorified cruelty"
  },
  {
    "id": "UgxAirjOr2nIMMVvtid4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Ezra’s words at the end really hit home 💕"
  },
  {
    "id": "UgzaCX1hr3I1EDB-8jN4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Ezra Klein is what emotional intelligence looks like. I’m impressed by that."
  },
  {
    "id": "UgwBL8gifFAG35bcQpN4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Huge respect for Ezra Klein!!!"
  },
  {
    "id": "UgyJfGmVy8sWKufoWQJ4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Israel has a reality problem, and they are currently committing war crimes. Thank you, Ezra, for your sober honesty here. The \"branding issue\" phrasing is so dismissive. I like Scott and his insights on a lot of topics, but his support for Israel at ANY cost has been very disappointing."
  },
  {
    "id": "Ugwxqy9OVGu_7hRD0Gh4AaABAg",
    "publishedAt": "4 months ago",
    "text": "What a wonderful, useful, enlightening, inspiring discussion. Thanks so much!"
  },
  {
    "id": "UgzV9zNXcI7Y-jqP_wx4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Israel's brand is \"aspirational\"? Someone get this out of touch old man off the air, he's embarrassing."
  },
  {
    "id": "Ugy07Zf3QLEqutnqW2h4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Good assessment & distinction .... Mamdani is very motivated by his sympathies and not resentment. often times people are in politics because of who they hate and not because who they are in it for.."
  },
  {
    "id": "UgxyuxaNI6Wvg2SjS5p4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Ezra Klein is brilliant!"
  },
  {
    "id": "UgxGnTGnOsEsLdILOwl4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Thank you"
  },
  {
    "id": "UgymQtqNk8vIuO_5y8N4AaABAg",
    "publishedAt": "4 months ago",
    "text": "People need to listen and read more Ezra Klein. He's brilliant, insightful, and decent."
  },
  {
    "id": "UgxpdAiqbFJWyjUbe1R4AaABAg",
    "publishedAt": "4 months ago",
    "text": "That was awesome❤"
  },
  {
    "id": "UgypMkCeYN5FLIgLcZ14AaABAg",
    "publishedAt": "4 months ago",
    "text": "Either you believe in human rights and equality of all people under the law OR you believe that apartheid occupation and ethnic cleaning is OK for some groups of people. You cannot have it both ways."
  },
  {
    "id": "UgxIWvubv9xinP7zAl94AaABAg",
    "publishedAt": "4 months ago",
    "text": "ONE OFVTHE BEST MOST CONSTRUCTIVE interviews yet !!! Host wow!"
  },
  {
    "id": "UgzuUFSBZUMsc19JMZR4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Make intelligence great again! Thank you so so much for such a deep and meaningful conversation! I am a huge fan of both of your work! Please stay engaged ❤"
  },
  {
    "id": "UgzLAK9VzNoSHHMRypp4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Sam, you are ahead of your time in this political climate that is so behind the true times. Your book on abundance is spot on. The earth and its inhabitants are going through an ascension process now that requires us to think in terms of what we want for a loving and prosperous humanity and that means having abundance on all levels. We have to have a vision of what we want for it to manifest and not just let the powers that be dictate for us. Everything that is created starts as a thought. People are awakening in large numbers even though it may not look like it. The awakening is part of the chaos because the status quo and corruption cannot hold; it’s breaking and people like you are helping it to fall so that we can get on with building a better society for all. Thank you for your work."
  },
  {
    "id": "UgynCTWuiYEKTc2K8Sx4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I was relieved when Ezra pushed back against Scott’s claim that Israel has a “brand problem,” which subtly places the burden on the global community for losing faith in Israel. If you’re trying to sell ethnic cleansing and a system of apartheid, your branding isn’t the problem."
  },
  {
    "id": "Ugz7Bf77N3edza6PZXJ4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I watched that debate and how Ezra stayed so patient blew me away. I was yelling at my laptop when Roberts said sadistic shit."
  },
  {
    "id": "UgyX6m0V_mFyYsJKvsR4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Scott having absolutely zero to say about Israel’s actions beyond the impact on ‘brand’ is not only disgusting but a total contrast to his willingness to portray Hamas (and Palestinians more broadly) in explicitly moral terms. These kinds of double standards have, in a post-Oct 7th world, become totally obvious."
  },
  {
    "id": "UgzUwIZSVrIoJgmu98l4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Instant new fan of Ezra Klein off this"
  },
  {
    "id": "Ugxlz3rhcjpry8D-W_54AaABAg",
    "publishedAt": "4 months ago",
    "text": "My two favorite podcasters having a discussion. Favorite cross-over episode!"
  },
  {
    "id": "UgxEpIKVRCgGD_emwAF4AaABAg",
    "publishedAt": "4 months ago",
    "text": "fantastic show."
  },
  {
    "id": "Ugzk5xooKDKPdwgaI6J4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Scott has been so wrong about Israel for so long. A blind spot."
  },
  {
    "id": "Ugysdq-qjPjWuVS1mnN4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I saw that debate and thought Ezra and Ben were amazing!"
  },
  {
    "id": "UgyLWnEdHO9PdbM-ROt4AaABAg",
    "publishedAt": "4 months ago",
    "text": "18:07 Mayor Pete's service record also makes him less gay and more tall in the eyes of the average American. One photo of him with a government issued carbine is enough to give pause to even the most staunch conservative pundit."
  },
  {
    "id": "UgzARd_E_Mg0zEHI0Ml4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I can feel Scott withering under Ezra's emphatic words on Israel because Scott basically is on Netanyahu's side or so it seems."
  },
  {
    "id": "UgzgReAVJsR1AcHnlJh4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Scotts determination to die on any hill he can find for Israel is disgusting and quickly ended my newfound fandom of his Podcast with Ed."
  },
  {
    "id": "UgwENKH6zqQqG9rKL-p4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Our Australian Treasurer is quite taken with Abundance. I hope, for the sake of our nation, that Ezra's philosophies add up! I'm personally very excited as to where this may lead ...... something definitely has to change."
  },
  {
    "id": "Ugxop_x9_pUYl8sjjlZ4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Not waiting to 72 to retire Scott , absurd lift the cap lower the age to 55"
  },
  {
    "id": "UgzoomnLgZn0KxjrUQV4AaABAg",
    "publishedAt": "4 months ago",
    "text": "“If we don’t do something quick, Sinwar would have won from inside the grave”. Hard hitting statement"
  },
  {
    "id": "Ugxsp9G4BMNVfABqRv54AaABAg",
    "publishedAt": "4 months ago",
    "text": "Committing genocide is a brand problem? You got a way to go Scott to taking a human viewpoint on this."
  },
  {
    "id": "UgxGe82PFYs4OIiDNzR4AaABAg",
    "publishedAt": "4 months ago",
    "text": "This is a prime example of someone you highly respect and admire being so wrong about something that it starts to make you question your own logic."
  },
  {
    "id": "Ugwix2PdBgfbrknl9ml4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I look forward to the day when I can vote for Pete Buttigieg! He doesn’t want to put things back the way they were before Trump came in with a wrecking ball, he plans decades in advance, and he knows that in order to write good policies, you have to fix the policy making process first. He truly is on another level! 🙌🏾"
  },
  {
    "id": "Ugw-kQJZtsnIQZxTYBh4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Scott, who I have come to admire greatly, exposes a weakness when expressing his scepticism about Magdami. The future mayor's honesty and straight forward solutions are precisely what Democrats need to counter fascism. We all need to see that politicians like him are successful if we ever want to rid ourselves of the MAGA scourge."
  },
  {
    "id": "UgwnZOnc0aGYJmNi_PR4AaABAg",
    "publishedAt": "4 months ago",
    "text": "We are not in a decent age."
  },
  {
    "id": "UgyrKFbCgCdndgqTKLl4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Keep Fighting for us!"
  },
  {
    "id": "UgwyBSnleil99xyHTlh4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Scott keeps singing songs of how brave and smart Israel is after ALL the damage Bibi continues to do. He has no sympathy for babies dying, absolutely none. He doesn’t sound like a good person AT ALL"
  },
  {
    "id": "UgwboGyn80g8rZVsE1t4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Heh, Porter '95! Go Slugs! UCSC is a great place, fond memories of my time there."
  },
  {
    "id": "UgzTrhum1cbu-bqerth4AaABAg",
    "publishedAt": "4 months ago (edited)",
    "text": "I agree with the Prof, 6ft white man, but I love the idea of Pete, incredible communicator who can talk to anyone and make them feel comfortable. Thank you for having Ezra as a guest, I find him fascinating."
  },
  {
    "id": "UgxuuFXku1_LUUUo-7l4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Great commentary! Thank you."
  },
  {
    "id": "Ugy38fMg9DArqmcBT6t4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I'd totally trust Pete Buttigieg to steer our ship. And Jamie Raskin, Elizabeth Warren, Adam Schiff, too."
  },
  {
    "id": "UgwsKvKBMnvexjM0gep4AaABAg",
    "publishedAt": "4 months ago",
    "text": "100% agree that parenting myself is hard!"
  },
  {
    "id": "UgxcY1_l62JnqgoWi9R4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Come on, Scott. Any country looks strong when sponsored by the US"
  },
  {
    "id": "Ugy5LLniCDJY5vzttot4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Fantastic interview! If the next president is the sort of person who would consult with Ezra and Scott, your country may start to heal."
  },
  {
    "id": "UgwgWQLeLeEs6Z-0rvZ4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Ezra in this conversation is very reasonable. He makes Scott look conservative. Ezra is usually the conservative to the leftist that I like"
  },
  {
    "id": "UgwJgUdQDJ7rDjOYeIN4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I heard that important yet aggravating debate!!"
  },
  {
    "id": "UgzjXpXSSxL5S4L9w1F4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I think I’m just pissed because they messaged the fuck out of project 2025 yet didn’t have a game plan???!!!!!"
  },
  {
    "id": "UgziKzv5rBv8uTXzb_94AaABAg",
    "publishedAt": "4 months ago",
    "text": "As a mom of 7 I think what Ezra had to say about parenting is so important. It is harder to parent yourself than to parent children."
  },
  {
    "id": "UgwdP3SwI8zpfWgbi4h4AaABAg",
    "publishedAt": "4 months ago",
    "text": "31:25 seriously? we're going to suggest that its OK if Israel does it because who are we to judge?"
  },
  {
    "id": "Ugz5R9rKXKekdvi8wJJ4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Is anyone listening to Michael Wolf and what he's saying about the Polaroids and such that he saw?"
  },
  {
    "id": "Ugyze4ED0i7sqKG6XFh4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Elise Slotkin is awful. She’s definitely a grievance candidate. Mamdani, like Bernie, is innately positive as a person. Bernie has an easy smile."
  },
  {
    "id": "UgxScZ6taOx57ckYBOV4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Interesting points drawn on commonalities between executives in business personhood, and statehood. These two are some of the most compelling voices at-present."
  },
  {
    "id": "UgylKmR3MTw_8mkRJ2p4AaABAg",
    "publishedAt": "4 months ago",
    "text": "38:59 slotkin is a fuckin joke …"
  },
  {
    "id": "UgybKJykp3Bq7_nSVSZ4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Excellent conversation. Ezra should be advising Netanyahu. Scott always does a great job of letting the interviewee speak. Very clean and clear conversation."
  },
  {
    "id": "UgyCP94BWHybkXEe8IF4AaABAg",
    "publishedAt": "4 months ago (edited)",
    "text": "‘Running from my own exhaustion.’ Lol. Dude just described the whole of my existence since I turned 40. Like Ezra, I’m 41 now. It’s heartening to hear I’m not alone. 😊"
  },
  {
    "id": "UgwQYL3P3eHrGdvhmUN4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Mamdani was polling 1% six months ago. then Bob's your uncle. Great political talent."
  },
  {
    "id": "UgwM94HUQR0EiujXMkJ4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I can't wait for the day when we can say a candidate is a great man or woman without needing their descriptors like Black or gay."
  },
  {
    "id": "UgwavQ7810aWblVYQwx4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Honesty from the heart"
  },
  {
    "id": "UgxQL9Vi3vD9NzMFiMt4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Mayor Mamdani's successful b/c everybody in NYC knows they're screwed & will work together to fix things."
  },
  {
    "id": "UgyGo7bleV2B1K3PQWl4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Yes, Pete for potus."
  },
  {
    "id": "Ugy-esaFANR4zc7Ngc14AaABAg",
    "publishedAt": "4 months ago",
    "text": "I’m impressed by that."
  },
  {
    "id": "UgwH8bdiRj1TtQxYy7t4AaABAg",
    "publishedAt": "4 months ago (edited)",
    "text": "For all of Scotts wisdom and viewpoints on politics that saw his rise in popularity, his stance on Israels inhumane tactics and lack of empathy for palestinians will be his downfall and will overshadow his character over anything else he has stood for. Like many others have said... Wake the F@#$ up Scott."
  },
  {
    "id": "UgyWCKVIc7netD4s-Ut4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Ezra is 👌…..articulate succinct! Great guest"
  },
  {
    "id": "Ugy22OOcDS7N5uDfy7l4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Insane stuff. Stoppong the genocide as a fkn brand problem. Jesus wept"
  },
  {
    "id": "UgxexZ5Mt-5e7ZNCIox4AaABAg",
    "publishedAt": "4 months ago",
    "text": "If the diaper fits, wear it. 👋🤑"
  },
  {
    "id": "Ugx1DnNOsyoBTUPBuyh4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I have listened to Scott many times and thought I respected his views. Not any more, I couldn't believe his views here. I have lost a life long liberal Jewish friend who spoke a bit like Scott. His defence of Israel's murdering policies and Netanyahu just because he's Jewish filled me with horror. I thought he was a more abstract thinker. He was like a brother whom I always looked up to. I will probably never speak to him again. I am deeply hurt by my lack of good judgement in putting him on a pedestal for 35 years of friendship. He did expose snippets over the years which I chose to ignore. But then the last two years happened."
  },
  {
    "id": "Ugx3HULfzwzaqeae21l4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Plain as day, I agree"
  },
  {
    "id": "UgzhsjD6nyWlUPK8y5p4AaABAg",
    "publishedAt": "4 months ago (edited)",
    "text": "Would be REALLY interested to hear how Scott squares starving children with his version of Masculinity. Erza explaind straight to Scotts face how Zionism is the Toxic, right wing version, of Masculinity when it comes to an idology around Judaism. He either is grifting when he talks about his version of Masculinity or he doesn't see Palestinians as humans. Neither is okay. Hope Scott re evaluates being a \"Full blown Zionist\". Until he re-evaluates that position I will be disengaging from all of his content and really encourage others to do the same."
  },
  {
    "id": "UgzBZgzGWsy9oSAY6eB4AaABAg",
    "publishedAt": "4 months ago",
    "text": "My god ezra is so good."
  },
  {
    "id": "Ugxi_H8sopyjiMRhtop4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Scott im a fan and youre right about complicity from some liberals as well as so called centrists. But i think its incumbent on people like yourselves to call it out in person. A prime example is Chris Cuomo whos show you were on recently. Only pleasantries were exchanged during that interview. Chris is lost in the weeds of false equivalences and both sideism."
  },
  {
    "id": "UgxrKjbPR2R8hamSFNh4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I agree with Ezra on how to build a better democracy."
  },
  {
    "id": "Ugxbc5oXEIUCdBtAbQx4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I have always said Pete would be great. He can speak well but he his will to go places and talk about stuff that Dems stay away from. And that is were a lot of voters are at right now."
  },
  {
    "id": "UgwZ7mHTnBfe9UECsDl4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Good discussion."
  },
  {
    "id": "UgwiGfhxcxisqssPPbp4AaABAg",
    "publishedAt": "4 months ago (edited)",
    "text": "I absolutely love Ezra Klein. What an incredible humanist :) ❤"
  },
  {
    "id": "UgzAALWReDNiC9fM-594AaABAg",
    "publishedAt": "4 months ago",
    "text": "I am a huge Fan of both of you! I wish I could’ve seen more energy from Scott but maybe it was just a down day? No worries. The right questions were asked and it was a great interview. Thank you!"
  },
  {
    "id": "UgzR68MoJoq0V_ty5Fl4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Pete is way capable"
  },
  {
    "id": "UgxLspYmZNogtzTSP_p4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Great interview!"
  },
  {
    "id": "UgzW4gWK4v-Eljo3M3V4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Wait Scott and Ezra in one Podcast. Drop everything..."
  },
  {
    "id": "UgyVAyKbP8FdqJRifVB4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Ezra really is the best."
  },
  {
    "id": "Ugwlol97b9aRRfWJtF14AaABAg",
    "publishedAt": "4 months ago",
    "text": "Gotta love Ezra. He's a real one. Excellent interview, Scott. Much appreciated."
  },
  {
    "id": "UgzLt0mEbHKTOEX6HUp4AaABAg",
    "publishedAt": "4 months ago",
    "text": "9:42 Abdul El-Sayed in Michigan"
  },
  {
    "id": "Ugy_I9wJ_Q_5Kos5VPh4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I listened to Pivot for several years, enjoyed Scott’s vibe and takes on many things, and I even defend the dirty jokes from the Kara stans, but I’ve had to stop listening to pretty much anything from them for the past couple years because Scott’s got his head stuck in the sand on the Israeli genocide, ongoing, and has refused to have conversations with anybody who would confront him or push back on it. This was a nice beginning, but Ezra is REALLY pulling his punches and serving it with A LOT of honey and Scott’s still equivocating and making excuses, talking about “national branding”…. :/"
  },
  {
    "id": "UgzQlR3e5EdGSXbb1Vp4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Geez Scott! I’m 66. Is it okay if I still listen?🦊🖤🐾"
  },
  {
    "id": "UgzQ82itggIlbThi_Ud4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I think Prof G is going to go home and seriously rethink his genocide comments. I think Mr. Klein opened a small can of whoop ass that ever so slightly rattled the good Professor."
  },
  {
    "id": "Ugx6K8oYW_BwEIpbVcV4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Yes Ezra can write and think. He speaks well all the time. What will it do to affect real change in the real world outside the internet ? Nothing"
  },
  {
    "id": "UgyqJ_cVvHhDmlziuQd4AaABAg",
    "publishedAt": "4 months ago",
    "text": "The fact that you are waking up to the reality of that country now simply means you either couldn't care less about what they did before or now it's so in your face that you can't avoid it. They have been involved in doing some version of these atrocities for several decades now. Rewind and play Ezra."
  },
  {
    "id": "Ugx2UkBfsx34Saosb-B4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Ezra is so thoughtful"
  },
  {
    "id": "UgxLJfmpWlHR7KMHnwh4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Man, I love Scott and have found him to be such an inspiration in so many ways. It is tough to see his lack of awareness around the atrocities in Israel."
  },
  {
    "id": "UgwSYi9bB03pgLbDt854AaABAg",
    "publishedAt": "4 months ago",
    "text": "Paul “TaxOnGas” Tsongas! That’s a blast from the past."
  },
  {
    "id": "Ugxj_VzGtwDoDEpCOwp4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I know Scott spends a lot of time talking about American men but for those of us who live overseas, we see it very differently. We live in countries where men and women work together and raise kids together. They are human beings doing what needs to be do to live life. Gaming became a Thing more in the US than any place. Just get on with life. As my father said: 'Do the things you need to do to live life and keep doing that when you live with others' ... and he did just that. He made his bed, washed his clothes, ironed, shopped, cooked, cleaned the toilet, mopped the floor, vacuumed, went to work, tended the garden (he did the food, my mom did the flowers). Get on with Life and live it. One huge issue in the US is that people have said: 'Let kids be kids' whereas in most of the countries, kids learn the skills they will need as adults."
  },
  {
    "id": "UgxNoGAGFEys8NP3-bl4AaABAg",
    "publishedAt": "4 months ago",
    "text": "By far two of the best voices in media. Thank you Scott and Ezra. Please keep your voices loud and clear. Hope Pete or Beto will join forces to find new leadership for the Dems or for a new way of doing politics."
  },
  {
    "id": "UgwV1JDi3DuTDNGWJBF4AaABAg",
    "publishedAt": "4 months ago",
    "text": "People need to wake up the fact that “liberal democracy” is not what people want. Left wing mob rule isn’t attractive. The final nails went in that coffin with the GF riots."
  },
  {
    "id": "UgyHl6C5mA5PxWk0RZ94AaABAg",
    "publishedAt": "4 months ago",
    "text": "Eight million Pre-Fab houses 5O% less in towns like Levittown. Long Island Circa 1947-1951)"
  },
  {
    "id": "Ugw1n_w6IxvgR6UZgYh4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Does Scott read these comments? Israel has lost the collective sympathy of the world. It had garnered since World War II."
  },
  {
    "id": "UgzUZlnQV3997DG4YkB4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Zohran Mamdani's the new NYC Mayor Fiorello La Guardia (1934-1946). Hugely popular."
  },
  {
    "id": "UgzEGKzkWNV-x_ShpmN4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Great discussion - always love listening to anything Ezra has to say!"
  },
  {
    "id": "UgzVLFxsBkV1C3cZj714AaABAg",
    "publishedAt": "4 months ago",
    "text": "It was odd to listen to Scott without his ego looming over the conversation. Good interview!"
  },
  {
    "id": "UgxXRfTL4_yViqN4WE54AaABAg",
    "publishedAt": "4 months ago",
    "text": "By the way, genocide is not a 'brand' problem. Your cold hearted description is breathtaking Scott."
  },
  {
    "id": "UgxXHXr0pS9sF4wxp0N4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I'm amazed at how hesitant Americans are to condemn the clearly horrific atrocities being committed by Israel in Gaza. How could there be any doubt that there is simply no justification for the horror that we're witnessing?"
  },
  {
    "id": "UgzgQRtAFbz2PKrH-AB4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Thank-you for speaking about Diaspora Jews regarding Israel. Is it a possibility for us to formally divorce ourselves from Israel? Ironically Israel is endangering us."
  },
  {
    "id": "UgwtewQ7l-mGFVejnv54AaABAg",
    "publishedAt": "4 months ago",
    "text": "Tax Code: the 1950s-1060s tax code was simple and brilliant in that it put the bulk of taxes on the high incomes, but required some tax liability for the entire population, no carve outs, no subsidies, no complicated deductions and loopholes."
  },
  {
    "id": "UgwDzJKARDCyAN0C49l4AaABAg",
    "publishedAt": "4 months ago",
    "text": "The more I see how apathetic Scott is to the suffering of innocent civilians the more I lose respect for him as a human being"
  },
  {
    "id": "UgyKc7MmYq3nAwWVbPl4AaABAg",
    "publishedAt": "4 months ago",
    "text": "1:02:34 UGH EZRA why is this the best take I’ve heard in a while and also… I feel attacked. It’s 11:58 and I have to get up at 5:30… so yeah. Brutal honesty man. Thanks for the reality check."
  },
  {
    "id": "UgzGmQjs_GQmro3C0Op4AaABAg",
    "publishedAt": "4 months ago (edited)",
    "text": "Ezra Klein is such an effective and talented communicator; his ability to synthesise complicated subjects is refreshing and invaluable to public discourse."
  },
  {
    "id": "Ugz8sP3rA8cOa0-VL9l4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Scott is a smozzer he likes to flatter people thats how you make friends you compliment people and in special ways learn to see the awesomeness in people"
  },
  {
    "id": "UgzsCJkZH5_DUk92blZ4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Calling it a \"brand\" assumes you can spin the act of starving children. What a shit show."
  },
  {
    "id": "UgynkHUzqd3hkOb3_GN4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Wow, great pod! Could you look into getting Allan Savory on the show re: ecology/mgmt?"
  },
  {
    "id": "UgzgQ-oS1GBWuOJCRT94AaABAg",
    "publishedAt": "4 months ago",
    "text": "Interesting to hear Ezra confirm that his primary source of information is books. I’ve long thought that must be the case and part of why he is a step above many others in this field. Plus he just has the intellect and the strong liberal ethics- and fashions thoughtful positions around those ethics, which makes him show as authentic."
  },
  {
    "id": "UgwTg31zh-1BCpEyU8d4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Scott!"
  },
  {
    "id": "UgzzXUqvQGiaJbmXWsB4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I would vote for Transportation Pete in a heartbeat."
  },
  {
    "id": "UgyNFChwGB6dqw-I3Cx4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Did he seriously say starving children is a branding issue that can be offset by strength"
  },
  {
    "id": "UgxEqsW1I2KOj6fi5Hl4AaABAg",
    "publishedAt": "4 months ago (edited)",
    "text": "You need to seriously take a long hard look at yourself Galloway. ‘Branding’- that’s where your concern and empathy is? Good grief. Unsubscribed."
  },
  {
    "id": "Ugzfcnk7vmhc6uEb0ol4AaABAg",
    "publishedAt": "4 months ago (edited)",
    "text": "Scott also has to be educated regarding the role that Israel and AIPAC played in the US invasion of Iraq. They essentially lobbied Bush administration to turn Iraq into a graveyard."
  },
  {
    "id": "Ugxu9NdD48-74Vl6VTd4AaABAg",
    "publishedAt": "4 months ago (edited)",
    "text": "How can we take Galloway seriously as an academic if he refuses to believe the academic consensus on Gaza? Mr. Galloway, are you that uneducated about the history and have that much disdain for the foremost holocaust scholars to deny thier conclusions that this is genocide? I mean you claim to be some sort of outsider, and I agree your take on economic inequality is insightful. However you literally revert to slop media talking points, instead of looking at the Academics and experts take on the Israel Issue. Historically speaking, zionism has been the aggressive party overall. They took land by force, they instigated most of the conflict and they are the occupier with the best technology in the world. The conflict and problems of European antisemitism came to them, they did not ask for it. Edit: please see below for more background as someone ignorant fool attempted poorly to refute this."
  },
  {
    "id": "Ugy4b6R4x6UxZnXf6Np4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Two brilliant comments: Not all \"Peters\" are created equal; and \"sticky\" was the perfect word...(for Scott)."
  },
  {
    "id": "UgyFkdCBqJ84J69aa9J4AaABAg",
    "publishedAt": "4 months ago",
    "text": "The black community in South Carolina is fine with two gay senators."
  },
  {
    "id": "Ugy2XEdU2KLLSbKJWRV4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Can I have a youtube setting where it doesn’t autoplay ezra klein?"
  },
  {
    "id": "Ugzz6l99X9XttTGRwdl4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Scott, branding is for companies; perception would be a better word."
  },
  {
    "id": "Ugw9egBTBwVXlnMXyCx4AaABAg",
    "publishedAt": "4 months ago",
    "text": "3:50 I’m pretty sure I would watch at this point"
  },
  {
    "id": "UgxjmP6s-AwtqbDlgb14AaABAg",
    "publishedAt": "4 months ago",
    "text": "Pete Buttigieg is incredible at going into hostile media and being make his points without being mean or cruel is peak masculinity. It is also nice to have a Veteran in the mix, since the US likes to throw people at foreign wars, then abandon them when they come home broken. Pete is a good human, and he has some real like experience that people can relate to. Ezra is correct that Pete talks about family with a reverence that is awe inspiring, because it wasn't always going to be a possibility for him. I appreciate Ezra's perspective and seeing him recognize and try to reconcile the current Israel ethno-nationalist problem. I will also point out that many people in the US right now are having a similar feeling about the current deportation program, which is also very ethno-nationalist."
  },
  {
    "id": "UgzoSkhlhjlCGNDfnwJ4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I didn't think it was possible to live in NYC and believe landlords are keeping up with maintenance..."
  },
  {
    "id": "Ugz49Zn7OUrYzA_hphB4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Josh Jackson a new host of The Daily Show co-signs the idea that Ezra Klein is a grifter on a book tour 0:14"
  },
  {
    "id": "Ugxcmm9zII25JCyoB5F4AaABAg",
    "publishedAt": "4 months ago",
    "text": "very good opinions"
  },
  {
    "id": "Ugx3uwBTlsc7LIaAZnt4AaABAg",
    "publishedAt": "4 months ago",
    "text": "So gross to hear Scott being concerned about Israel's \"BRANDING\".....welp, it's been very \"genocide forward\"."
  },
  {
    "id": "UgzhVSmBzXqe9dbq5614AaABAg",
    "publishedAt": "4 months ago",
    "text": "Must rebuild the government in new form. Smaller. Efficient. Working."
  },
  {
    "id": "UgwnJAj-358dNL2LOsl4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Scott’s primary concern is Israeli brand perception, not the slaughter and starvation of thousands of innocent civilians."
  },
  {
    "id": "UgwmiWPHnRY-o472tKB4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Great"
  },
  {
    "id": "UgwH88Sa6e0nvMJ8cul4AaABAg",
    "publishedAt": "4 months ago",
    "text": "I would vote for Pete Buttigieg without hesitation. He has no equal 💙. I’m a 65-year-old woman, mexican immigrant and have been a Democrat since becoming a U.S. citizen."
  },
  {
    "id": "Ugx8Qm-tIOibIuLc6MN4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Great podcast. I completely agree with the attitude of focus - work with laser focus on two or three things with an obsession on quality, not twenty things done half-assed. (My words not Kleins; that’s my paraphrase.)"
  },
  {
    "id": "UgxVGpl-o_qQ9rQM6qZ4AaABAg",
    "publishedAt": "4 months ago",
    "text": "The world should be full of people like Ezra Klein."
  },
  {
    "id": "UgwR-QquMBhvN02hvEl4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Genocide is not a good \"brand\". Come on guys let's wake the fuck up."
  },
  {
    "id": "UgyHfeo99U-8BbUl1GV4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Prof. G - either have Jeffry Sacks on your podcast or stop talking about Israel/Palestine."
  },
  {
    "id": "UgwqPSJ3nfqhTu-j57N4AaABAg",
    "publishedAt": "4 months ago",
    "text": "They need to acknowledge regular people have no voice or power and the system is rigged for the wealthy. Don’t vilify the rich, instead elevate the lower 90%. This happens by complete campaign finance reform."
  },
  {
    "id": "Ugyol5EZpscUXu_cK5l4AaABAg",
    "publishedAt": "4 months ago",
    "text": "Interesting to see a conversation where Scott's guest is on a whole other intellectual level."
  },
  {
    "id": "Ugy_UX15j59J5AYYtxF4AaABAg",
    "publishedAt": "4 months ago",
    "text": "DECR Dept. of Defense by $ 600 billion/Yr to free Luxury busses, and better roads. Put the soldiers to work doing that."
  },
  {
    "id": "UgzY81b-7LTze5sXda54AaABAg",
    "publishedAt": "4 months ago",
    "text": "A mind boggling demonstration of intelligence. Thank you both."
  },
  {
    "id": "Ugx_QtDzkWMoAMub3mV4AaABAg",
    "publishedAt": "4 months ago (edited)",
    "text": "We can't find this discussion with our leaders - because we don't have a decent leader anywhere to be found (USA) so....here we are, getting it from YT and our current affairs podcasters that can hold the conversations."
  },
  {
    "id": "UgxKgrEJcvSq3LQEL294AaABAg",
    "publishedAt": "4 months ago",
    "text": "This is ESSENTIAL for EVERY American to understand! Thank you for this episode! 🩵✨"
  },
  {
    "id": "UgzAcJDc3ixAAzV4o854AaABAg",
    "publishedAt": "4 months ago",
    "text": "Great interview!"
  }
]
