{
  "platform": "youtube",
  "videoId": "IPsu4pMpIjk",
  "videoUrl": "https://www.youtube.com/watch?v=IPsu4pMpIjk",
  "title": "Trump, Israel, and the Future of Liberal Democracy — with Ezra Klein | Prof G Conversations",
  "description": "Scott speaks with Ezra Klein, New York Times columnist and host of The Ezra Klein Show, to discuss America’s political crossroads. They talk about Trump’s influence, the Democratic Party’s leadership gap, and the growing divide among American Jews over Israel. Ezra also shares his thoughts on the future of democracy, rising nationalism, and how to rebuild trust in U.S. institutions.\n\nFollow Ezra Klein, ‪@EzraKleinShow‬.\n\nTimestamps\n00:00 - In This Episode\n1:47 - What did you mean by questioning whether we are in a “decent” age?\n3:27 - Do you think leadership has been conflated with cruelty?\n6:42 - What do you think will be the profile of the next Democratic leader?\n12:18 - Will the next Democratic leader be a straight, white male over 6 feet?\n16:33 - Is America, specifically the black community in South Carolina, ready for a gay president?\n19:06 - Break\n19:10 - What broke the consensus that held American Jews together?\n22:48 - What are your thoughts on Israel's brand?\n28:16 - Could Israel argue that this war has been worth it?\n31:28 - Has America been guilty of committing war crimes?\n31:52 - What are your thoughts on Mamdani?\n35:39 - What lessons can Democrats take from Mamdani's victory?\n40:42 - What surprised you about the latest Epstein scandal and its political fallout?\n42:08 - What are your thoughts on the sudden interest in Ghislaine Maxwell's testimony?\n44:39 - What advice would you give Democrats on handling the Epstein scandal?\n46:12 - Break\n46:14 - What surprised you about the response to your book Abundance?\n48:20 - Was your goal to push for real programs, like a bold federal housing plan?\n52:22 - Should we steadily lower the Medicare age in a move toward socialized medicine?\n53:39 - What are your thoughts on a 50% alternative minimum tax and ending the estate tax exemption?\n54:47 - What’s your strategy for using different media platforms, and which are you focusing on? \n58:12 - What shaped your path - and what advice do you have for young people who want to follow it?\n1:02:11 - What have you learned about being a good dad and partner?\n1:04:07 - Do you struggle to balance success with being an engaged partner and father? \n1:06:29 - What would you tell your 25-year-old self?\n\n\nPlease support this channel by subscribing here: \nhttps://links.profgmedia.com/youtube-...\n\nWant more Prof G? Check out everything we're up to at\nhttps://links.profgmedia.com/home\n\n#scottgalloway #ezraklein #usa #politics #trumpadministration #government #podcast #podcastshow #america #trump #profg #conservative #democrats #republican",
  "channel": {
    "platform": "youtube",
    "channelId": "UC1E1SVcVyU3ntWMSQEp38Yw",
    "channelTitle": "The Prof G Pod – Scott Galloway",
    "channelUrl": "https://www.youtube.com/@TheProfGPod"
  },
  "publishedAt": "Aug 1, 2025",
  "thumbnailUrl": "https://i.ytimg.com/vi/IPsu4pMpIjk/hqdefault.jpg"
}
